# SymbolicCutbackForBeamAndTruss Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSettings..::..SymbolicCutbackForBeamAndTruss Property
StructuralSettings Class See Also
---
Symbolic cutback distance to be applied to all beams and trusses.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double SymbolicCutbackForBeamAndTruss { get; set; }
```

Visual Basic
---
```text
Public Property SymbolicCutbackForBeamAndTruss As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SymbolicCutbackForBeamAndTruss {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace